Assignment5/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (-17.6777 17.6777 0)
    (0 25 0)
    (17.6777 17.6777 0)
    (25 0 0)
    (17.6777 -17.6777 0)
    (0 -25 0)
    (-17.6777 -17.6777 0)
    (-25 0 0)
    (-100 100 0)
    (100 100 0)
    (100 -100 0)
    (-100 -100 0)
    (0 0 100)
    (-17.6777 17.6777 100)
    (0 25 100)
    (17.6777 17.6777 100)
    (25 0 100)
    (17.6777 -17.6777 100)
    (0 -25 100)
    (-17.6777 -17.6777 100)
    (-25 0 100)
    (-100 100 100)
    (100 100 100)
    (100 -100 100)
    (-100 -100 100)
);

edges
(
    arc 1 3 (0 25 0)
    arc 3 5 (25 0 0)
    arc 5 7 (0 -25 0)
    arc 7 1 (-25 0 0)
    arc 14 16 (0 25 100)
    arc 16 18 (25 0 100)
    arc 18 20 (0 -25 100)
    arc 20 14 (-25 0 100)
);

blocks
(
    hex (5 11 10 3 18 24 23 16) (50 50 1) simpleGrading (1 1 1)
    hex (10 9 1 3 23 22 14 16) (50 50 1) simpleGrading (1 1 1)
    hex (7 12 11 5 20 25 24 18) (50 50 1) simpleGrading (1 1 1)
    hex (1 9 12 7 14 22 25 20) (50 50 1) simpleGrading (1 1 1) 
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (5 11 12 7)
            (11 5 3 10)
            (7 12 9 1)
            (3 1 9 10)
            (23 22 14 16)
            (14 22 25 20)
            (18 24 23 16)
            (20 25 24 18)
        );
    }

    topAndBottom
    {
        type wall;
        faces
        (
            (10 9 22 23)
            (24 25 12 11)
        );
    }

    hot
    {
        type wall;
        faces
        (
            (9 12 25 22)
        );
    }

    cold
    {
        type wall;
        faces
        (
            (23 24 11 10)
        );
    }
    innerWall
    {
        type wall;
        faces
        (
	    
            (7 5 20 18)
            (5 18 16 3)
            (16 14 1 3)
            (14 1 7 20)
        );
    }
);

mergePatchPairs
(
);
